InformationRegisters/СостоянияВакансий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>СостоянияВакансий</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияВакансии</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Вакансия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Вакансии</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/СостоянияВакансии.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>СостоянияВакансии</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Открыта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Приостановлена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Закрыта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отменена</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

InformationRegisters/СостоянияВакансий/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// См. СтандартныеПодсистемыСервер.ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод
Процедура ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод(Методы) Экспорт
	Методы.Вставить("ИсправитьСостоянияВакансий");
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область ОбработчикиПравилРегистрации

// См. ЗарплатаКадрыРасширенныйСинхронизацияДанных.ШаблонОбработчика
Процедура ПриЗаполненииНастроекОбработчиковПравилРегистрации(Настройки) Экспорт
	ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляНезависимогоРегистра(Настройки, "Вакансия",
		"ПодборПерсонала");
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура УстановитьСостояние(Вакансии, ДатаСостояния, Состояние) Экспорт
	
	// Получаем на указанную дату по этим вакансиям все состояния
	// Если на выбранную дату у вакансии есть более приоритетные состояния - удаляем их
	// Например, если вакансия приостановлена, и устанавливается состояние Открыта, 
	// то запись Приостановлена на этот день удаляется.
	
	Выборка = Обработки.ОбходКоллекции.НовыйОбход(СостоянияВакансий(Вакансии));
	Пока Выборка.СледующийПоЗначениюПоля("Вакансия") Цикл
		НаборЗаписей = СоздатьНаборЗаписей();
		Добавлено = Ложь;
		Пока Выборка.Следующий() Цикл
			Данные = Выборка.ТекущиеДанные();
			Если Данные.Период >= НачалоДня(ДатаСостояния) И Данные.Период <= КонецДня(ДатаСостояния)
				И ПриоритетСостояния(Данные.Состояние) >= ПриоритетСостояния(Состояние) Тогда
				// Пропускаем записи на этот день, приоритет которых выше или такой же.
				// Остальные добавляем как есть.
				Продолжить;
			КонецЕсли;
			Если Не Добавлено И Данные.Период > КонецДня(ДатаСостояния) Тогда
				ДобавитьСостояние(НаборЗаписей, ДатаСостояния, Состояние, Данные.Вакансия);
				Добавлено = Истина;
			КонецЕсли;
			ЗаполнитьЗначенияСвойств(НаборЗаписей.Добавить(), Данные);
		КонецЦикла;
		Если Не Добавлено Тогда
			ДобавитьСостояние(НаборЗаписей, ДатаСостояния, Состояние, Данные.Вакансия);
		КонецЕсли;
		НаборЗаписей.Отбор.Вакансия.Установить(Данные.Вакансия);
		НаборЗаписей.Записать();
	КонецЦикла;
	
КонецПроцедуры

// Изменить дату выбранного состояния вакансии.
// 
// Параметры:
//  Вакансия - СправочникСсылка.Вакансии
//  Состояние - ПеречислениеСсылка.СостоянияВакансии
//  ПрежняяДата - Дата
//  НоваяДата - Дата
Процедура ИзменитьДатуСостояния(Вакансия, Состояние, ПрежняяДата, НоваяДата) Экспорт
	
	НаборЗаписей = СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Вакансия.Установить(Вакансия);
	НаборЗаписей.Прочитать();
	
	Нашли = Ложь;
	Для Каждого СтрокаНабора Из НаборЗаписей Цикл
		Если СтрокаНабора.Состояние = Состояние И НачалоДня(СтрокаНабора.Период) = НачалоДня(ПрежняяДата) Тогда
			СтрокаНабора.Период = НоваяДата;
			Нашли = Истина;
		КонецЕсли;
	КонецЦикла;
	
	ОбщегоНазначенияКлиентСервер.Проверить(Нашли, 
		СтрШаблон(НСтр("ru = 'Не удалось изменить дату состояния, 
					   |т.к. не обнаружено состояния %1 на дату %2 у вакансии %3.'"),
			Состояние, Формат(ПрежняяДата, "ДЛФ=D;"), Вакансия));
	
	НаборЗаписей.Записать();
	
КонецПроцедуры

// Параметры:
//  Вакансии - Массив Из СправочникСсылка.Вакансии
// 
// Возвращаемое значение:
//  Соответствие Из КлючИЗначение:
//		Ключ - СправочникСсылка.Вакансии
//		Значение - Структура
Функция ТекущееСостояниеВакансий(Вакансии) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Вакансии", Вакансии);
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СостоянияВакансий.Период,
		|	СостоянияВакансий.Вакансия,
		|	СостоянияВакансий.Состояние
		|ИЗ
		|	РегистрСведений.СостоянияВакансий.СрезПоследних(, Вакансия В (&Вакансии)) КАК СостоянияВакансий";
	ТаблицаРезультат = Запрос.Выполнить().Выгрузить();
	
	Соответствие = Новый Соответствие;
	Для Каждого СтрокаТаблицы Из ТаблицаРезультат Цикл
		Соответствие.Вставить(СтрокаТаблицы.Вакансия, ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(СтрокаТаблицы));
	КонецЦикла;
	
	Возврат Соответствие;
	
КонецФункции

// Метод выявляет состояния вакансий, которые будут отменены вследствие установки указанного состояния на выбранную дату.
// Логика состояний предполагает, что в один и тот же день не может быть
// менее приоритетного состояния после более приоритетного.
// Иначе говоря, если отмененная, приостановленная или закрытая вакансия возобновляется в тот же день,
// то сведения об отмене, приостановке или закрытии не сохраняются
// 
// Параметры:
//  Вакансии - Массив из СправочникСсылка.Вакансии -
//  Состояние - ПеречислениеСсылка.СостоянияВакансии - устанавливаемое состояние
//  ДатаСостояния - Дата - дата устанавливаемого состояния
// 
// Возвращаемое значение:
//  Соответствие из КлючИЗначение
Функция ОтменяемыеСостоянияВакансий(Вакансии, Состояние, ДатаСостояния) Экспорт
	
	ОтменяемыеСостояния = Новый Соответствие();
	
	ТекущиеСостояния = ТекущееСостояниеВакансий(Вакансии);
	Для Каждого КлючИЗначение Из ТекущиеСостояния Цикл
		ДанныеСостояния = КлючИЗначение.Значение;
		Если НачалоДня(ДанныеСостояния.Период) = НачалоДня(ДатаСостояния) 
			И ПриоритетСостояния(ДанныеСостояния.Состояние) >= ПриоритетСостояния(Состояние) 
			И ДанныеСостояния.Состояние <> Состояние Тогда
			ОтменяемыеСостояния.Вставить(КлючИЗначение.Ключ, ДанныеСостояния);
		КонецЕсли;
	КонецЦикла;
	
	Возврат ОтменяемыеСостояния;
	
КонецФункции

Функция СостоянияВакансий(Вакансии)

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Вакансии", Вакансии);
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Вакансии.Ссылка КАК Вакансия,
		|	СостоянияВакансий.Период КАК Период,
		|	СостоянияВакансий.Состояние КАК Состояние
		|ИЗ
		|	Справочник.Вакансии КАК Вакансии
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияВакансий КАК СостоянияВакансий
		|		ПО (Вакансии.Ссылка = СостоянияВакансий.Вакансия)
		|ГДЕ
		|	Вакансии.Ссылка В(&Вакансии)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Вакансии.Ссылка,
		|	СостоянияВакансий.Период";
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

// Добавить строку состояния в набор записей.
// Исключает повторное добавление строки с тем же состоянием
// 
// Параметры:
//  НаборЗаписей - РегистрСведенийНаборЗаписей.СостоянияВакансий - Набор записей
//  ДатаСостояния - Дата -
//  Состояние - ПеречислениеСсылка.СостоянияВакансии -
//  Вакансия - СправочникСсылка.Вакансии -
// 
// Возвращаемое значение:
//  Булево - если Истина, то состояние было добавлено, Ложь в противном случае.
Функция ДобавитьСостояние(НаборЗаписей, ДатаСостояния, Состояние, Вакансия)

	Если НаборЗаписей.Количество() = 0 Или НаборЗаписей[НаборЗаписей.Количество() - 1].Состояние <> Состояние Тогда
		СтрокаНабора = НаборЗаписей.Добавить();
		СтрокаНабора.Период = ПодборПерсоналаКлиентСервер.ДатаВремяПоСостоянию(ДатаСостояния, Состояние);
		СтрокаНабора.Вакансия = Вакансия;
		СтрокаНабора.Состояние = Состояние;
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

Процедура ПодготовитьОбновлениеЗависимыхДанныхПриОбменеПередЗаписью(Объект, Замещение) Экспорт
	СохранитьПрежнийНаборЗаписей(Объект, Замещение);
КонецПроцедуры

Процедура ПодготовитьОбновлениеЗависимыхДанныхПриОбменеПриЗаписи(Объект, Замещение) Экспорт
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыКорпоративнаяПодсистемы.ПодборПерсонала.АналитикаДанных") Тогда
		МодульПодборПерсоналаАналитикаДанных = ОбщегоНазначения.ОбщийМодуль("ПодборПерсоналаАналитикаДанных");
		МодульПодборПерсоналаАналитикаДанных.ЗаполнитьТаблицуОбновленияСостоянийВакансий(Объект, Замещение);
	КонецЕсли;
	
КонецПроцедуры

Процедура СохранитьПрежнийНаборЗаписей(НаборЗаписей, Замещение) Экспорт
	
	Значения = РегистрыБЗК.ЗначенияОтбораЗаписейНабора(НаборЗаписей, Замещение, "Вакансия", Истина);
	Если Значения = Неопределено Или Значения.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ПрежнийНабор = РегистрыБЗК.ЗаписиНабораИзБазыДанных(НаборЗаписей, Замещение);
	НаборЗаписей.ДополнительныеСвойства.Вставить("ПрежнийНабор", ПрежнийНабор);
	
КонецПроцедуры

// Проверяет валидность состояний, повторы состояний.
// 
// Параметры:
//  Состояния - ТаблицаЗначений -
//  Вакансия - СправочникСсылка.Вакансии
Процедура ПроверитьСостояния(Состояния, Вакансия) Экспорт
	
	ОбщегоНазначенияКлиентСервер.Проверить(Состояния.Количество() > 0, 
		СтрШаблон(НСтр("ru = 'В списке состояний вакансии %1 должна быть как минимум одна запись'"), Вакансия));

	ОбщегоНазначенияКлиентСервер.Проверить(Состояния[0].Состояние = Перечисления.СостоянияВакансии.Открыта, 
		СтрШаблон(НСтр("ru = 'Список состояний вакансии %1 должен начинаться с состояния %2'"), 
			Вакансия, Перечисления.СостоянияВакансии.Открыта));

	ДатыСостояний = Новый Соответствие();
	Для Каждого СтрокаСостояния Из Состояния Цикл
		ОбщегоНазначенияКлиентСервер.Проверить(ЗначениеЗаполнено(НачалоДня(СтрокаСостояния.Период)), 
			НСтр("ru = 'Дата не заполнена'"));
		ОбщегоНазначенияКлиентСервер.Проверить(ЗначениеЗаполнено(СтрокаСостояния.Состояние), 
			НСтр("ru = 'Состояние не заполнено'"));
		ДатаСостояния = ДатыСостояний[ПриоритетСостояния(СтрокаСостояния.Состояние)];
		ОбщегоНазначенияКлиентСервер.Проверить(
			ДатаСостояния = Неопределено Или ДатаСостояния <> НачалоДня(СтрокаСостояния.Период), 
			СтрШаблон(НСтр("ru = 'Повторяется состояние %1 у вакансии %2 в один и тот же день %3.
						   |Состояния %4 и %5 не могут быть использованы в один день.'"),
				СтрокаСостояния.Состояние, 
				Вакансия, 
				Формат(СтрокаСостояния.Период, "ДЛФ=D;"),
				Перечисления.СостоянияВакансии.Закрыта,
				Перечисления.СостоянияВакансии.Отменена));
		ДатыСостояний.Вставить(ПриоритетСостояния(СтрокаСостояния.Состояние), НачалоДня(СтрокаСостояния.Период));
	КонецЦикла;
	
	Для Индекс = 1 По Состояния.Количество() - 1 Цикл
		ОбщегоНазначенияКлиентСервер.Проверить(Состояния[Индекс].Состояние <> Состояния[Индекс - 1].Состояние,
			СтрШаблон(
				НСтр("ru = 'Повторяется состояние %1 у вакансии %2, сначала %3, затем %4.
					 |Вакансию нельзя перевести в состояние, в котором она уже находится, 
					 |то есть состояния не должны повторяться в хронологическом порядке.'"),
				Состояния[Индекс].Состояние, 
				Вакансия, 
				Формат(Состояния[Индекс - 1].Период, "ДЛФ=D;"),
				Формат(Состояния[Индекс].Период, "ДЛФ=D;")));
	КонецЦикла;

КонецПроцедуры

Функция ПриоритетСостояния(Состояние)
	Приоритеты = Новый Соответствие();
	Приоритеты.Вставить(Перечисления.СостоянияВакансии.Открыта, 1);
	Приоритеты.Вставить(Перечисления.СостоянияВакансии.Приостановлена, 2);
	Приоритеты.Вставить(Перечисления.СостоянияВакансии.Закрыта, 3);
	Приоритеты.Вставить(Перечисления.СостоянияВакансии.Отменена, 3);
	Возврат Приоритеты[Состояние];
КонецФункции

#Область ОбновлениеИнформационнойБазы

Процедура ИсправитьСостоянияВакансий(ПараметрыОбновления) Экспорт
	
	ОбновлениеИБ = ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый;

	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("ЧасПриостановки", ПодборПерсоналаКлиентСервер.ЧасПриостановки());
	Запрос.УстановитьПараметр("ЧасЗакрытияОтмены", ПодборПерсоналаКлиентСервер.ЧасЗакрытияОтмены());
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СостоянияВакансий.Вакансия КАК Вакансия,
		|	СостоянияВакансий.Состояние КАК Состояние,
		|	СостоянияВакансий.Период КАК Период,
		|	МИНИМУМ(ПоследующиеСостояния.Период) КАК ДатаПоследующего
		|ПОМЕСТИТЬ ВТДатыПоследующих
		|ИЗ
		|	РегистрСведений.СостоянияВакансий КАК СостоянияВакансий
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияВакансий КАК ПоследующиеСостояния
		|		ПО (ПоследующиеСостояния.Вакансия = СостоянияВакансий.Вакансия)
		|			И (ПоследующиеСостояния.Период > СостоянияВакансий.Период)
		|
		|СГРУППИРОВАТЬ ПО
		|	СостоянияВакансий.Вакансия,
		|	СостоянияВакансий.Состояние,
		|	СостоянияВакансий.Период
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ ПЕРВЫЕ 100
		|	Вакансии.Ссылка КАК Вакансия
		|ИЗ
		|	Справочник.Вакансии КАК Вакансии
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияВакансий КАК СостоянияВакансий
		|		ПО Вакансии.Ссылка = СостоянияВакансий.Вакансия
		|ГДЕ
		|	СостоянияВакансий.Вакансия ЕСТЬ NULL
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ ПЕРВЫЕ 100
		|	Вакансии.Ссылка
		|ИЗ
		|	Справочник.Вакансии КАК Вакансии
		|ГДЕ
		|	ИСТИНА В
		|			(ВЫБРАТЬ ПЕРВЫЕ 1
		|				ИСТИНА
		|			ИЗ
		|				РегистрСведений.СостоянияВакансий КАК СостоянияВакансий
		|			ГДЕ
		|				СостоянияВакансий.Вакансия = Вакансии.Ссылка
		|				И СостоянияВакансий.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияВакансии.Приостановлена)
		|				И ЧАС(СостоянияВакансий.Период) <> 10)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ ПЕРВЫЕ 100
		|	Вакансии.Ссылка
		|ИЗ
		|	Справочник.Вакансии КАК Вакансии
		|ГДЕ
		|	ИСТИНА В
		|			(ВЫБРАТЬ ПЕРВЫЕ 1
		|				ИСТИНА
		|			ИЗ
		|				РегистрСведений.СостоянияВакансий КАК СостоянияВакансий
		|			ГДЕ
		|				СостоянияВакансий.Вакансия = Вакансии.Ссылка
		|				И СостоянияВакансий.Состояние В (ЗНАЧЕНИЕ(Перечисление.СостоянияВакансии.Закрыта), ЗНАЧЕНИЕ(Перечисление.СостоянияВакансии.Отменена))
		|				И ЧАС(СостоянияВакансий.Период) <> 12)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 100
		|	Вакансии.Вакансия
		|ИЗ
		|	(ВЫБРАТЬ
		|		СостоянияВакансий.Вакансия КАК Вакансия
		|	ИЗ
		|		ВТДатыПоследующих КАК ДатыПоследующих
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияВакансий КАК СостоянияВакансий
		|			ПО (СостоянияВакансий.Вакансия = ДатыПоследующих.Вакансия)
		|				И (СостоянияВакансий.Период = ДатыПоследующих.ДатаПоследующего)
		|				И (СостоянияВакансий.Состояние = ДатыПоследующих.Состояние)) КАК Вакансии
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 100
		|	Вакансии.Вакансия
		|ИЗ
		|	(ВЫБРАТЬ
		|		СостоянияВакансий.Вакансия КАК Вакансия,
		|		СостоянияВакансий.Состояние КАК Состояние,
		|		КОЛИЧЕСТВО(СостоянияВакансий.Состояние) КАК КоличествоСостояний,
		|		НАЧАЛОПЕРИОДА(СостоянияВакансий.Период, ДЕНЬ) КАК Период
		|	ИЗ
		|		РегистрСведений.СостоянияВакансий КАК СостоянияВакансий
		|	
		|	СГРУППИРОВАТЬ ПО
		|		СостоянияВакансий.Вакансия,
		|		СостоянияВакансий.Состояние,
		|		НАЧАЛОПЕРИОДА(СостоянияВакансий.Период, ДЕНЬ)
		|	
		|	ИМЕЮЩИЕ
		|		КОЛИЧЕСТВО(СостоянияВакансий.Состояние) > 1) КАК Вакансии";
	
	ОписаниеДанных = Новый Массив;
	ОписаниеДанных.Добавить(ОписаниеБлокируемыхДанных(Метаданные.Справочники.Вакансии));
	ОписаниеДанных.Добавить(ОписаниеБлокируемыхДанных(Метаданные.РегистрыСведений.СостоянияВакансий));

	Если Не ОбновлениеИБ.НачатьОбновлениеДанных(ОписаниеДанных, ПараметрыОбновления) Тогда
		Возврат;
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		ОбновлениеИБ.ЗавершитьОбновлениеДанных(ПараметрыОбновления);
		ПараметрыОбновления.ОбработкаЗавершена = Истина;
		Возврат;
	КонецЕсли;
	
	ПараметрыОбновления.ОбработкаЗавершена = Ложь;
	
	Выборка = Обработки.ОбходКоллекции.НовыйОбход(СостоянияВакансий(РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Вакансия")));
	Пока Выборка.СледующийПоЗначениюПоля("Вакансия") Цикл
		НаборЗаписей = СоздатьНаборЗаписей();
		Приоритеты = Новый Соответствие();
		Пока Выборка.Следующий() Цикл
			Данные = Выборка.ТекущиеДанные();
			Если Данные.Период = Null Тогда
				Продолжить;
			КонецЕсли;
			Если Приоритеты[НачалоДня(Данные.Период)] = Неопределено 
				Или Приоритеты[НачалоДня(Данные.Период)] < ПриоритетСостояния(Данные.Состояние) Тогда
				Если ДобавитьСостояние(НаборЗаписей, Данные.Период, Данные.Состояние, Данные.Вакансия) Тогда
					Приоритеты.Вставить(НачалоДня(Данные.Период), ПриоритетСостояния(Данные.Состояние));
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		Если НаборЗаписей.Количество() = 0 Тогда
			// Если нет ни одного состояния, добавляем открытие по умолчанию с очень ранней датой 01 января 2000.
			ДобавитьСостояние(НаборЗаписей, Дата(2000, 1, 1), Перечисления.СостоянияВакансии.Открыта, Данные.Вакансия);
		КонецЕсли;
		НаборЗаписей.Отбор.Вакансия.Установить(Данные.Вакансия);
		ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(НаборЗаписей);
	КонецЦикла;

	ОбновлениеИБ.ЗавершитьОбновлениеДанных(ПараметрыОбновления);
	
КонецПроцедуры

Функция ОписаниеБлокируемыхДанных(МетаданныеОбъекта)
	Описание = ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ОписаниеБлокируемыхДанных(МетаданныеОбъекта);
	Описание.ПоляБлокировки.Очистить();
	Возврат Описание;
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецЕсли
